title: Rapid Password spraying - 4768
id: 44dc280a-4351-4389-9169-c976094de661
description: Detects a large number of authentication failures for distinct users from one source host within a short time period.
author: Michael Music
date: 2020/12/06
tags:
    - attack.credential_access
    - attack.t1110.003
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4768
        AccountName: '*'
        WorkstationName: '*'
    filter:
        UserName: "*$"
    timeframe: 5m
    condition:
        - selection and not filter | count(UserName) by WorkstationName > 100
falsepositives:
    - Vulnerability scanners
    - Penetration testing
    - Misconfigured application/services
level: low