title: Rapid Password spraying - 4625
id: d00bcac5-e10f-4050-a480-1c29bae14d99
description: Detects a large number of authentication failures for distinct users from one source host within a short time period.
author: Michael Music
date: 2020/12/06
tags:
    - attack.credential_access
    - attack.t1110.003
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4625
        UserName: '*'
        WorkstationName: '*'
    filter:
        UserName: "*$"
    timeframe: 5m
    condition:
        - selection and not filter | count(UserName) by WorkstationName > 100
falsepositives:
    - Vulnerability scanners
    - Penetration testing
    - Misconfigured application/services
level: low